PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_smif.h
/** The SMIF modes to work with an external memory. */
typedef enum
{
    CY_SMIF_NORMAL,         /**< Command mode (MMIO mode). */
    CY_SMIF_MEMORY          /**< XIP (eXecute In Place) mode. */
} cy_en_smif_mode_t;

typedef enum
{
    CY_SMIF_DLL_DIVIDE_BY_2  = 0,    /**< Divides DLL Clock by 2 */
    CY_SMIF_DLL_DIVIDE_BY_4  = 1,    /**< Divides DLL Clock by 4 */
    CY_SMIF_DLL_DIVIDE_BY_8  = 2,    /**< Divides DLL Clock by 8 */
    CY_SMIF_DLL_DIVIDE_BY_16 = 3,    /**< Divides DLL Clock by 16 */
} cy_en_smif_dll_divider_t;

#if (CY_IP_MXSMIF_VERSION>=4)
/* This field is only applicable in SDR transmit mode. */
typedef enum
{
    CY_SMIF_TX_ONE_PERIOD_AHEAD = 0, /**< transmit data is launched nominally 1 PLL clock period ahead of the rising edge of the clock out to the memory */
    CY_SMIF_TX_TWO_PERIOD_AHEAD = 1, /**< transmit data is launched nominally 2 PLL clock periods ahead of the rising edge of the clock out to the memory */
} cy_en_smif_tx_sdr_extra_t;

/* Determines the relative amount of delay through the MDL in terms of the number of tap delays. */
typedef enum
{
    CY_SMIF_MDL_1_TAP_DELAY  = 0, /**< 1 tap delay */
    CY_SMIF_MDL_2_TAP_DELAY  = 1, /**< 2 tap delay */
    CY_SMIF_MDL_3_TAP_DELAY  = 2, /**< 3 tap delay */
    CY_SMIF_MDL_4_TAP_DELAY  = 3, /**< 4 tap delay */
    CY_SMIF_MDL_5_TAP_DELAY  = 4, /**< 5 tap delay */
    CY_SMIF_MDL_6_TAP_DELAY  = 5, /**< 6 tap delay */
    CY_SMIF_MDL_7_TAP_DELAY  = 6, /**< 7 tap delay */
    CY_SMIF_MDL_8_TAP_DELAY  = 7, /**< 8 tap delay */
    CY_SMIF_MDL_9_TAP_DELAY  = 8, /**< 9 tap delay */
    CY_SMIF_MDL_10_TAP_DELAY  = 9, /**< 10 tap delay */
    CY_SMIF_MDL_11_TAP_DELAY  = 10, /**< 11 tap delay */
    CY_SMIF_MDL_12_TAP_DELAY  = 11, /**< 12 tap delay */
    CY_SMIF_MDL_13_TAP_DELAY  = 12, /**< 13 tap delay */
    CY_SMIF_MDL_14_TAP_DELAY  = 13, /**< 14 tap delay */
    CY_SMIF_MDL_15_TAP_DELAY  = 14, /**< 15 tap delay */
    CY_SMIF_MDL_16_TAP_DELAY  = 15, /**< 16 tap delay */
    CY_SMIF_MDL_TAP_NUMBER  = 16, /**< Tap Count */
} cy_en_cy_smif_mdl_tap_sel_t;

/* Determines the relative amount of delay through the SDL (including neg and pos) in terms of the number of tap delays. */
typedef enum
{
    CY_SMIF_SDL_1_TAP_DELAY  = 0, /**< 1 tap delay */
    CY_SMIF_SDL_2_TAP_DELAY  = 1, /**< 2 tap delay */
    CY_SMIF_SDL_3_TAP_DELAY  = 2, /**< 3 tap delay */
    CY_SMIF_SDL_4_TAP_DELAY  = 3, /**< 4 tap delay */
    CY_SMIF_SDL_5_TAP_DELAY  = 4, /**< 5 tap delay */
    CY_SMIF_SDL_6_TAP_DELAY  = 5, /**< 6 tap delay */
    CY_SMIF_SDL_7_TAP_DELAY  = 6, /**< 7 tap delay */
    CY_SMIF_SDL_8_TAP_DELAY  = 7, /**< 8 tap delay */
    CY_SMIF_SDL_9_TAP_DELAY  = 8, /**< 9 tap delay */
    CY_SMIF_SDL_10_TAP_DELAY  = 9, /**< 10 tap delay */
    CY_SMIF_SDL_11_TAP_DELAY  = 10, /**< 11 tap delay */
    CY_SMIF_SDL_12_TAP_DELAY  = 11, /**< 12 tap delay */
    CY_SMIF_SDL_13_TAP_DELAY  = 12, /**< 13 tap delay */
    CY_SMIF_SDL_14_TAP_DELAY  = 13, /**< 14 tap delay */
    CY_SMIF_SDL_15_TAP_DELAY  = 14, /**< 15 tap delay */
    CY_SMIF_SDL_16_TAP_DELAY  = 15, /**< 16 tap delay */
    CY_SMIF_SDL_TAP_NUMBER  = 16, /**< Tap Count */
} cy_en_cy_smif_sdl_tap_sel_t;

/* Determines the relative amount of delay through the MDL/SDL(including neg and pos) for the reference clock in terms of the number of tap delays. */
typedef enum
{
    CY_SMIF_DDL_1_TAP_DELAY  = 0, /**< 1 tap delay */
    CY_SMIF_DDL_2_TAP_DELAY  = 1, /**< 2 tap delay */
    CY_SMIF_DDL_3_TAP_DELAY  = 2, /**< 3 tap delay */
    CY_SMIF_DDL_4_TAP_DELAY  = 3, /**< 4 tap delay */
    CY_SMIF_DDL_5_TAP_DELAY  = 4, /**< 5 tap delay */
    CY_SMIF_DDL_6_TAP_DELAY  = 5, /**< 6 tap delay */
    CY_SMIF_DDL_7_TAP_DELAY  = 6, /**< 7 tap delay */
    CY_SMIF_DDL_8_TAP_DELAY  = 7, /**< 8 tap delay */
    CY_SMIF_DDL_9_TAP_DELAY  = 8, /**< 9 tap delay */
    CY_SMIF_DDL_10_TAP_DELAY  = 9, /**< 10 tap delay */
    CY_SMIF_DDL_11_TAP_DELAY  = 10, /**< 11 tap delay */
    CY_SMIF_DDL_12_TAP_DELAY  = 11, /**< 12 tap delay */
    CY_SMIF_DDL_13_TAP_DELAY  = 12, /**< 13 tap delay */
    CY_SMIF_DDL_14_TAP_DELAY  = 13, /**< 14 tap delay */
    CY_SMIF_DDL_15_TAP_DELAY  = 14, /**< 15 tap delay */
    CY_SMIF_DDL_16_TAP_DELAY  = 15, /**< 16 tap delay */
    CY_SMIF_DDL_TAP_NUMBER  = 16, /**< Tap Count */
} cy_en_cy_smif_ddl_tap_sel_t;

#define CY_SMIF_CLKOUT_NON_ZERO_MDL_TAP_MIN_SDR  (CY_SMIF_MDL_3_TAP_DELAY)   /* In SDR mode, when CLKOUT is not divide by two, this is the minimum acceptable MDL tap */
#define CY_SMIF_CLKOUT_NON_ZERO_MDL_TAP_MAX_SDR  (CY_SMIF_MDL_13_TAP_DELAY)  /* In SDR mode, when CLKOUT is not divide by two, this is the maximum acceptable MDL tap */
#define CY_SMIF_CLKOUT_NON_ZERO_MDL_TAP_MIN_DDR  (CY_SMIF_MDL_3_TAP_DELAY)   /* In DDR mode, when CLKOUT is not divide by two, this is the minimum acceptable MDL tap */
#define CY_SMIF_CLKOUT_NON_ZERO_MDL_TAP_MAX_DDR  (CY_SMIF_MDL_14_TAP_DELAY)  /* In DDR mode, when CLKOUT is not divide by two, this is the maximum acceptable MDL tap */
#endif  /* (CY_IP_MXSMIF_VERSION>=4) */

typedef enum
{
    CY_SMIF_DELAY_TAP_DISABLE = 0,    /**< The SMIF Delay tap disable */
    CY_SMIF_DELAY_TAP_ENABLE = 1,    /**< The SMIF Delay tap enable */
} cy_en_smif_delay_tap_t;

/** The SMIF transfer status return values. */
typedef enum
{
    CY_SMIF_STARTED,       /**< The SMIF started. */
    CY_SMIF_SEND_COMPLETE, /**< The data transmission is complete. */
    CY_SMIF_SEND_BUSY,     /**< The data transmission is in progress. */
    CY_SMIF_RX_COMPLETE,   /**< The data reception is completed. */
    CY_SMIF_RX_BUSY,       /**< The data reception is in progress. */
    CY_SMIF_XIP_ERROR,     /**< An XIP alignment error. */
    CY_SMIF_CMD_ERROR,     /**< A TX CMD FIFO overflow. */
    CY_SMIF_TX_ERROR,      /**< A TX DATA FIFO overflow. */
    CY_SMIF_RX_ERROR       /**< An RX DATA FIFO underflow. */

} cy_en_smif_txfr_status_t;

/** The SMIF API return values. */
typedef enum
{
    CY_SMIF_SUCCESS = 0x00U,           /**< Successful SMIF operation. */
    CY_SMIF_CMD_FIFO_FULL   = CY_SMIF_ID | CY_PDL_STATUS_ERROR | 0x01U,    /**< The command is cancelled. The command FIFO is full. */
    CY_SMIF_EXCEED_TIMEOUT  = CY_SMIF_ID | CY_PDL_STATUS_ERROR | 0x02U,   /**< The SMIF operation timeout exceeded. */
    /**
    * The device does not have a QE bit. The device detects
    * 1-1-4 and 1-4-4 Reads based on the instruction.
    */
    CY_SMIF_NO_QE_BIT       = CY_SMIF_ID | CY_PDL_STATUS_ERROR | 0x03U,
    CY_SMIF_BAD_PARAM       = CY_SMIF_ID | CY_PDL_STATUS_ERROR | 0x04U,  /**< The SMIF API received the wrong parameter */
    CY_SMIF_NO_SFDP_SUPPORT = CY_SMIF_ID | CY_PDL_STATUS_ERROR | 0x05U,  /**< The external memory does not support SFDP (JESD216B). */
    CY_SMIF_NOT_HYBRID_MEM  = CY_SMIF_ID | CY_PDL_STATUS_ERROR | 0x06U,  /**< The external memory is not hybrid */
    CY_SMIF_SFDP_CORRUPTED_TABLE = CY_SMIF_ID | CY_PDL_STATUS_ERROR | 0x07U, /**< The SFDP table is corrupted */
    /** Failed to initialize the slave select 0 external memory by auto detection (SFDP). */
    CY_SMIF_SFDP_SS0_FAILED = CY_SMIF_ID | CY_PDL_STATUS_ERROR |
                              ((uint32_t)CY_SMIF_SFDP_FAIL << CY_SMIF_SFDP_FAIL_SS0_POS),
    /** Failed to initialize the slave select 1 external memory by auto detection (SFDP). */
    CY_SMIF_SFDP_SS1_FAILED = CY_SMIF_ID | CY_PDL_STATUS_ERROR |
                              ((uint32_t)CY_SMIF_SFDP_FAIL << CY_SMIF_SFDP_FAIL_SS1_POS),
    /** Failed to initialize the slave select 2 external memory by auto detection (SFDP). */
    CY_SMIF_SFDP_SS2_FAILED = CY_SMIF_ID | CY_PDL_STATUS_ERROR |
                              ((uint32_t)CY_SMIF_SFDP_FAIL << CY_SMIF_SFDP_FAIL_SS2_POS),
    /** Failed to initialize the slave select 3 external memory by auto detection (SFDP). */
    CY_SMIF_SFDP_SS3_FAILED = CY_SMIF_ID | CY_PDL_STATUS_ERROR |
                              ((uint32_t)CY_SMIF_SFDP_FAIL << CY_SMIF_SFDP_FAIL_SS3_POS),
    /** The command API is not supported for this memory device. */
    CY_SMIF_CMD_NOT_FOUND = CY_SMIF_ID | CY_PDL_STATUS_ERROR | 0x80U,
    /** SFDP Buffer Insufficient. */
    CY_SMIF_SFDP_BUFFER_INSUFFICIENT = CY_SMIF_ID | CY_PDL_STATUS_ERROR | 0x81U,
    /**
    * The device does not have a OE bit. The device detects
    * 1-1-8 and 1-8-8 Reads based on the instruction.
    */
    CY_SMIF_NO_OE_BIT       = CY_SMIF_ID | CY_PDL_STATUS_ERROR | 0x82U,
    /** SMIF is currently busy and cannot accept the request */
    CY_SMIF_BUSY            = CY_SMIF_ID | CY_PDL_STATUS_ERROR | 0x83U,
    CY_SMIF_GENERAL_ERROR   = CY_SMIF_ID | CY_PDL_STATUS_ERROR | 0x84U, /**< Some general error */
} cy_en_smif_status_t;

/** The SMIF slave select definitions for the driver API. Each slave select is
 * represented by an enumeration that has the bit corresponding to the slave
 * select number set. */
typedef enum
{
    CY_SMIF_SLAVE_SELECT_0 = 1U,  /**< The SMIF slave select 0  */
    CY_SMIF_SLAVE_SELECT_1 = 2U,  /**< The SMIF slave select 1  */
    CY_SMIF_SLAVE_SELECT_2 = 4U,  /**< The SMIF slave select 2  */
    CY_SMIF_SLAVE_SELECT_3 = 8U   /**< The SMIF slave select 3  */
} cy_en_smif_slave_select_t;

#if (CY_IP_MXSMIF_VERSION>=2) || defined (CY_DOXYGEN)
/** Specifies receive capture mode. */
typedef enum
{
    CY_SMIF_SEL_NORMAL_SPI = 0U,                   /**< Normal SPI without DLP. */
    CY_SMIF_SEL_NORMAL_SPI_WITH_DLP = 1U,          /**< Normal SPI with DLP (Data Learning Pattern). */
    CY_SMIF_SEL_XSPI_HYPERBUS_WITH_DQS = 2U,       /**< xSPI or HYPER BUS with Data strobe line. */
} cy_en_smif_capture_mode_t;
#endif

#if (CY_IP_MXSMIF_VERSION>=2) || defined (CY_DOXYGEN)

/** Specifies the clock source for the receiver clock. */
typedef enum
{
    CY_SMIF_SEL_OUTPUT_CLK   = 0U,  /**< The SMIF output clock */
    CY_SMIF_SEL_INVERTED_OUTPUT_CLK   = 1U,  /**< The SMIF inverted output clock */
    CY_SMIF_SEL_FEEDBACK_CLK     = 2U,  /**< The SMIF feedback clock */
    CY_SMIF_SEL_INVERTED_FEEDBACK_CLK = 3U,   /**< The SMIF feedback inverted clock */
    CY_SMIF_SEL_INTERNAL_CLK     = 4U,  /**< The SMIF internal clock */
    CY_SMIF_SEL_INVERTED_INTERNAL_CLK = 5U,  /**< The SMIF internal inverted clock */
    CY_SMIF_SEL_INVERTED_SPHB_RWDS_CLK = 6U,  /**< The SMIF internal inverted clock */
    CY_SMIF_SEL_SPHB_RWDS_CLK = 7U,  /**< The SMIF internal inverted clock */
} cy_en_smif_clk_select_t;
#endif

