PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_smif.h
/** Specifies SMIF cache configuration. */
typedef struct
{
    bool                        enabled;                 /**< Enable/Disable SMIF Internal CACHE.*/
    bool                        cache_retention_on;      /**< If set, retains CACHE in DeepSleep mode. Not applicable in Deep Sleep OFF or Deep Sleep RAM mode.*/
    cy_stc_smif_cache_region_t  cache_region_0;          /**< CACHE region 0 configuration. */
    cy_stc_smif_cache_region_t  cache_region_1;          /**< CACHE region 1 configuration. */
    cy_stc_smif_cache_region_t  cache_region_2;          /**< CACHE region 2 configuration. */
    cy_stc_smif_cache_region_t  cache_region_3;          /**< CACHE region 3 configuration. */
} cy_stc_smif_cache_config_t;
#endif
/** \} group_smif_data_structures */


/**
* \addtogroup group_smif_low_level_functions
* \{
*/

cy_en_smif_status_t Cy_SMIF_Init(SMIF_Type *base, cy_stc_smif_config_t const *config,
                                 uint32_t timeout,
                                 cy_stc_smif_context_t *context);
#if (CY_IP_MXSMIF_VERSION>=4) || defined (CY_DOXYGEN)
cy_en_smif_status_t Cy_SMIF_DllConfig(volatile SMIF_Type *base,
                                      cy_stc_smif_config_t const *config,
                                      cy_stc_smif_context_t *context);
#endif
void Cy_SMIF_DeInit(SMIF_Type *base);
void Cy_SMIF_SetDataSelect(SMIF_Type *base, cy_en_smif_slave_select_t slaveSelect,
                           cy_en_smif_data_select_t dataSelect);
void Cy_SMIF_SetMode(SMIF_Type *base, cy_en_smif_mode_t mode);
cy_en_smif_mode_t Cy_SMIF_GetMode(SMIF_Type const *base);
cy_en_smif_status_t Cy_SMIF_TransmitCommand(SMIF_Type *base,
        uint8_t cmd,
        cy_en_smif_txfr_width_t cmdTxfrWidth,
        uint8_t const cmdParam[], uint32_t paramSize,
        cy_en_smif_txfr_width_t paramTxfrWidth,
        cy_en_smif_slave_select_t slaveSelect, uint32_t completeTxfr,
        cy_stc_smif_context_t const *context);
cy_en_smif_status_t Cy_SMIF_TransmitData(SMIF_Type *base,
        uint8_t const *txBuffer, uint32_t size,
        cy_en_smif_txfr_width_t transferWidth,
        cy_smif_event_cb_t TxCompleteCb,
        cy_stc_smif_context_t *context);
cy_en_smif_status_t  Cy_SMIF_TransmitDataBlocking(SMIF_Type *base,
        uint8_t const *txBuffer,
        uint32_t size,
        cy_en_smif_txfr_width_t transferWidth,
        cy_stc_smif_context_t const *context);
cy_en_smif_status_t Cy_SMIF_ReceiveData(SMIF_Type *base,
                                        uint8_t *rxBuffer, uint32_t size,
                                        cy_en_smif_txfr_width_t transferWidth,
                                        cy_smif_event_cb_t RxCompleteCb,
                                        cy_stc_smif_context_t *context);
cy_en_smif_status_t  Cy_SMIF_ReceiveDataBlocking(SMIF_Type *base,
        uint8_t *rxBuffer,
        uint32_t size,
        cy_en_smif_txfr_width_t transferWidth,
        cy_stc_smif_context_t const *context);
cy_en_smif_status_t Cy_SMIF_SendDummyCycles(SMIF_Type *base, uint32_t cycles);
cy_en_smif_txfr_status_t Cy_SMIF_GetTransferStatus(SMIF_Type const *base, cy_stc_smif_context_t const *context);
void Cy_SMIF_Enable(SMIF_Type *base, cy_stc_smif_context_t *context);

#if (CY_IP_MXSMIF_VERSION>=2) || defined (CY_DOXYGEN)
cy_en_smif_status_t Cy_SMIF_TransmitCommand_Ext(SMIF_Type *base,
        uint16_t cmd,
        bool isCommand2byte,
        cy_en_smif_txfr_width_t cmdTxfrWidth,
        cy_en_smif_data_rate_t cmdDataRate,
        uint8_t const cmdParam[],
        uint32_t paramSize,
        cy_en_smif_txfr_width_t paramTxfrWidth,
        cy_en_smif_data_rate_t paramDataRate,
        cy_en_smif_slave_select_t slaveSelect,
        uint32_t completeTxfr,
        cy_stc_smif_context_t const *context);

cy_en_smif_status_t Cy_SMIF_TransmitData_Ext(SMIF_Type *base,
        uint8_t const *txBuffer,
        uint32_t size,
        cy_en_smif_txfr_width_t transferWidth,
        cy_en_smif_data_rate_t dataDataRate,
        cy_smif_event_cb_t TxCmpltCb,
        cy_stc_smif_context_t *context);

cy_en_smif_status_t Cy_SMIF_TransmitDataBlocking_Ext(SMIF_Type *base,
        uint8_t const *txBuffer,
        uint32_t size,
        cy_en_smif_txfr_width_t transferWidth,
        cy_en_smif_data_rate_t dataDataRate,
        cy_stc_smif_context_t const *context);

cy_en_smif_status_t Cy_SMIF_ReceiveData_Ext(SMIF_Type *base,
        uint8_t *rxBuffer,
        uint32_t size,
        cy_en_smif_txfr_width_t transferWidth,
        cy_en_smif_data_rate_t dataRate,
        cy_smif_event_cb_t RxCmpltCb,
        cy_stc_smif_context_t *context);

cy_en_smif_status_t Cy_SMIF_ReceiveDataBlocking_Ext(SMIF_Type *base,
        uint8_t *rxBuffer,
        uint32_t size,
        cy_en_smif_txfr_width_t transferWidth,
        cy_en_smif_data_rate_t dataRate,
        cy_stc_smif_context_t const *context);

cy_en_smif_status_t Cy_SMIF_SendDummyCycles_Ext(SMIF_Type *base,
        cy_en_smif_txfr_width_t transferWidth,
        cy_en_smif_data_rate_t dataRate,
        uint32_t cycles);
cy_en_smif_status_t Cy_SMIF_SendDummyCycles_With_RWDS(SMIF_Type *base,
        bool read_rwds,
        bool refresh_indicator,
        uint32_t cycles);
void Cy_SMIF_DeviceTransfer_SetMergeTimeout(SMIF_Type *base, cy_en_smif_slave_select_t slave, cy_en_smif_merge_timeout_t timeout);
void Cy_SMIF_DeviceTransfer_ClearMergeTimeout(SMIF_Type *base, cy_en_smif_slave_select_t slave);


/* MDL and SDL tap select functions. */
#if (CY_IP_MXSMIF_VERSION == 2U) || (CY_IP_MXSMIF_VERSION >= 4U) || defined (CY_DOXYGEN)
cy_en_smif_status_t Cy_SMIF_Set_DelayTapSel(SMIF_Type *base, uint8_t tapSel);
uint8_t Cy_SMIF_Get_DelayTapSel(SMIF_Type *base);
#endif
#if (CY_IP_MXSMIF_VERSION >= 4U) || defined (CY_DOXYGEN)
cy_en_smif_status_t Cy_SMIF_Set_Sdl_DelayTapSel(SMIF_CORE_DEVICE_Type *smif_device_base, uint8_t tapSel);
#endif

#endif /* CY_IP_MXSMIF_VERSION>=2*/

__STATIC_INLINE void Cy_SMIF_Disable(SMIF_Type *base);
__STATIC_INLINE void  Cy_SMIF_SetInterruptMask(SMIF_Type *base, uint32_t interrupt);
__STATIC_INLINE uint32_t  Cy_SMIF_GetInterruptMask(SMIF_Type const *base);
__STATIC_INLINE uint32_t  Cy_SMIF_GetInterruptStatusMasked(SMIF_Type const *base);
__STATIC_INLINE uint32_t  Cy_SMIF_GetInterruptStatus(SMIF_Type const *base);
__STATIC_INLINE void  Cy_SMIF_SetInterrupt(SMIF_Type *base, uint32_t interrupt);
__STATIC_INLINE void  Cy_SMIF_ClearInterrupt(SMIF_Type *base, uint32_t interrupt);
__STATIC_INLINE void  Cy_SMIF_SetTxFifoTriggerLevel(SMIF_Type *base, uint32_t level);
__STATIC_INLINE void  Cy_SMIF_SetRxFifoTriggerLevel(SMIF_Type *base, uint32_t level);
__STATIC_INLINE uint32_t  Cy_SMIF_GetCmdFifoStatus(SMIF_Type const *base);
__STATIC_INLINE uint32_t  Cy_SMIF_GetTxFifoStatus(SMIF_Type const *base);
__STATIC_INLINE uint32_t  Cy_SMIF_GetRxFifoStatus(SMIF_Type const *base);
cy_en_smif_status_t  Cy_SMIF_Encrypt(SMIF_Type *base,
                                     uint32_t address,
                                     uint8_t data[],
                                     uint32_t size,
                                     cy_stc_smif_context_t const *context);
__STATIC_INLINE bool Cy_SMIF_BusyCheck(SMIF_Type const *base);
__STATIC_INLINE void Cy_SMIF_Interrupt(SMIF_Type *base, cy_stc_smif_context_t *context);
cy_en_smif_status_t Cy_SMIF_CacheEnable(SMIF_Type *base, cy_en_smif_cache_t cacheType);
cy_en_smif_status_t Cy_SMIF_CacheDisable(SMIF_Type *base, cy_en_smif_cache_t cacheType);
cy_en_smif_status_t Cy_SMIF_CachePrefetchingEnable(SMIF_Type *base, cy_en_smif_cache_t cacheType);
cy_en_smif_status_t Cy_SMIF_CachePrefetchingDisable(SMIF_Type *base, cy_en_smif_cache_t cacheType);
cy_en_smif_status_t Cy_SMIF_CacheInvalidate(SMIF_Type *base, cy_en_smif_cache_t cacheType);
void Cy_SMIF_SetCryptoKey(SMIF_Type *base, uint32_t *key);
void Cy_SMIF_SetCryptoIV(SMIF_Type *base, uint32_t *nonce);
cy_en_smif_status_t Cy_SMIF_SetCryptoEnable(SMIF_Type *base, cy_en_smif_slave_select_t slaveId);
cy_en_smif_status_t Cy_SMIF_SetCryptoDisable(SMIF_Type *base, cy_en_smif_slave_select_t slaveId);
cy_en_smif_status_t Cy_SMIF_IsCryptoEnabled(SMIF_Type *base, cy_en_smif_slave_select_t slaveId, bool *crypto_status);

#if (CY_IP_MXSMIF_VERSION>=5) || defined (CY_DOXYGEN)
cy_en_smif_status_t Cy_SMIF_SetCryptoKeyRegion(SMIF_Type *base,        uint8_t crypto_region_index, cy_stc_smif_crypto_region_config_t *region_config);
cy_en_smif_status_t Cy_SMIF_SetCryptoSubRegionDisable(SMIF_Type *base,          uint8_t crypto_region_index, uint8_t mask);
#endif //(CY_IP_MXSMIF_VERSION>=5) || defined (CY_DOXYGEN)

cy_en_smif_status_t Cy_SMIF_ConvertSlaveSlotToIndex(cy_en_smif_slave_select_t ss, uint32_t *device_idx);

#if (defined (CY_IP_MXSMIF_VERSION) && (CY_IP_MXSMIF_VERSION>=4)) || defined (CY_DOXYGEN)
cy_en_smif_status_t Cy_SMIF_SetRxCaptureMode(SMIF_Type *base, cy_en_smif_capture_mode_t mode, cy_en_smif_slave_select_t slaveId);
#if (defined (SMIF_BRIDGE_PRESENT) && (SMIF_BRIDGE_PRESENT == 1u)) || defined (CY_DOXYGEN)
bool Cy_SMIF_IsBridgeOn(SMIF_Base_Type *base);
cy_en_smif_status_t Cy_SMIF_Bridge_Enable(SMIF_Base_Type *base, bool enable);
#endif /* (defined (SMIF_BRIDGE_PRESENT) && (SMIF_BRIDGE_PRESENT == 1u)) */
#endif  /* (CY_IP_MXSMIF_VERSION>=4) */

